eurolinux-enterprise-linux-sources/man-pages-ko/src/man8/mkfs.minix.8
.\" Copyright 1992, 1993, 1994 Rickard E. Faith (faith@cs.unc.edu)
.\" May be freely distributed.
.\" " for emacs hilit19 mode
.TH MKFS 8 "10 January 1994" "Linux 0.99" "Linux Programmer's Manual"
.SH 이름
mkfs.minix \- 리눅스용 MINIX 파일 시스템 만들기
.SH 사용법
.BR "mkfs.minix [ \-c ] [ \-n"
\fI이름길이\fR
.B ] [ \-i
\fIinode갯수\fR
.B ]
\fI장치이름\fR \fI블럭크기\fR
.br
.B "mkfs [ \-l"
\fI파일이름\fR
.B ]
\fI장치이름\fR \fI블럭크기\fR
.SH 설명
.B mkfs.minix
명령은 지정한 장치(일반적으로 디스크의 한 파티션)를 리눅스용 
MINIX 파일시스템으로 만든다.

사용되는 \fI장치이름\fR은 일반적으로 다음과 같다:

.nf
.RS
/dev/hda[1-8]
/dev/hdb[1-8]
/dev/sda[1-8]
/dev/sdb[1-8]
.RE
.fi

.I 블럭크기
인자는 블럭단위의 파일 시스템 크기를 말한다.
이 정보는 
.BR fdisk (8)
명령으로 조사할 수 있다.
이 값은 10보다 크고 65536보다 작아야한다.
.SH 옵션
.TP
.B \-c
파일 시스템을 만들기 전에 블량 블럭(bad bloock)을 검사한다.
만약 불량블럭이 발견되면 그 갯수를 출력한다.
.TP
.BI \-n " 이름길이"
파일 이름으로 사용할 수 있는 최대 글자수를 지정한다. 
.B \-n
다음에 공백문자 없이 숫자를 지정해도 괜찮다. 사용될 수 있는 값은 
14\-30이다.
.B 30이 초기값이다. 
.TP
.BI \-i " inode갯수"
파일 시스템의 inode 갯수를 지정한다.
.TP
.BI \-l " 파일이름"
.IR 파일이름
으로부터 불량 블럭 목록을 읽는다.
이 파일은 한줄에 하나의 블량 블럭 번호를 가진다. 읽혀진 불량 블럭의 갯수가
출력된다.
.SH "마침 코드값"
.B mkfs.minix
풀그림이 종료될 때 돌려주는(return) 값은 다음과 같다:
.IP 0
오류 없음.
.IP 8
수행 오류
.IP 16
사용법이나, 문법 오류
.SH "관련 항목"
.BR fsck (8),
.BR mkefs (8),
.BR efsck (8),
.BR reboot (8)
.SH 만든이
Linus Torvalds (torvalds@cs.helsinki.fi)
.br
Rik Faith (faith@cs.unc.edu) 오류 코드값 추가
.br
Scott Heavner (sdh@po.cwru.edu) inode 조사 기능 추가
.br
Dr. Wettstein (greg%wind.uucp@plains.nodak.edu) 파일 시스템 인자 사용 가능
.br
Daniel Quinlan (quinlan@yggdrasil.com) 이미 마운트 되어 있는 
파일 시스템의 mkfs 작업 확인과 부트 섹터 지우기 기능 추가
